ARMmbed/mbed-os/connectivity/drivers/lora/TARGET_STM32WL/STM32WL_LoRaRadio.cpp

/**
 / _____)             _              | |
( (____  _____ ____ _| |_ _____  ____| |__
 \____ \| ___ |    (_   _) ___ |/ ___)  _ \
 _____) ) ____| | | || |_| ____( (___| | | |
(______/|_____)_|_|_| \__)_____)\____)_| |_|
    (C)2015 Semtech
 ___ _____ _   ___ _  _____ ___  ___  ___ ___
/ __|_   _/_\ / __| |/ / __/ _ \| _ \/ __| __|
\__ \ | |/ _ \ (__| ' <| _| (_) |   / (__| _|
|___/ |_/_/ \_\___|_|\_\_| \___/|_|_\\___|___|
embedded.connectivity.solutions===============

Description: LoRaWAN stack layer that controls both MAC and PHY underneath

License: Revised BSD License, see LICENSE.TXT file include in the project

Maintainer: Miguel Luis, Gregory Cristian & Gilbert Menth

Copyright (c) 2019, Arm Limited and affiliates.

SPDX-License-Identifier: BSD-3-Clause
  */
/**
  ******************************************************************************
  *
  *          Portions COPYRIGHT 2021 STMicroelectronics
  *
  * @file    STM32WL_LoRaRadio.cpp
  * @author  MCD Application Team
  * @brief   radio driver implementation
  ******************************************************************************
  */


#include <math.h>
#include "ThisThread.h"
#include "Timer.h"
#include "STM32WL_LoRaRadio.h"

uint8_t regulator_mode = MBED_CONF_STM32WL_LORA_DRIVER_REGULATOR_MODE;

uint8_t crystal_select  = MBED_CONF_STM32WL_LORA_DRIVER_CRYSTAL_SELECT;

uint8_t board_rf_switch_config  = MBED_CONF_STM32WL_LORA_DRIVER_RF_SWITCH_CONFIG;


static void SUBGHZ_Radio_IRQHandler(void);

// Handler called by thread in response to signal directly
static void RadioIrqProcess();

// Structure containing function pointers to the stack callbacks
static radio_events_t *_radio_events;

//SUBGHZ handle Structure definition
SUBGHZ_HandleTypeDef hsubghz;

// Data buffer used for both TX and RX
static uint8_t _data_buffer[MAX_DATA_BUFFER_SIZE_STM32WL];

static radio_operating_mode_t _operating_mode;
static uint8_t _active_modem;

using namespace std::chrono;
using namespace mbed;


/**
  * @brief voltage of vdd tcxo.
  */
#define TCXO_CTRL_VOLTAGE           TCXO_CTRL_1_7V

/*!
 * FSK bandwidth definition
 */
typedef struct {
    uint32_t bandwidth;
    uint8_t  register_value;
} fsk_bw_t;

static const fsk_bw_t fsk_bandwidths[] = {
    { 4800, 0x1F },
    { 5800, 0x17 },
    { 7300, 0x0F },
    { 9700, 0x1E },
    { 11700, 0x16 },
    { 14600, 0x0E },
    { 19500, 0x1D },
    { 23400, 0x15 },
    { 29300, 0x0D },
    { 39000, 0x1C },
    { 46900, 0x14 },
    { 58600, 0x0C },
    { 78200, 0x1B },
    { 93800, 0x13 },
    { 117300, 0x0B },
    { 156200, 0x1A },
    { 187200, 0x12 },
    { 234300, 0x0A },
    { 312000, 0x19 },
    { 373600, 0x11 },
    { 467000, 0x09 },
    { 500000, 0x00 }, // Invalid Bandwidth
};

const uint8_t sync_word[] = {0xC1, 0x94, 0xC1, 0x00, 0x00, 0x00, 0x00, 0x00};

// in ms                                 SF12    SF11    SF10    SF9    SF8    SF7
const float lora_symbol_time[3][6] = {{ 32.768, 16.384, 8.192, 4.096, 2.048, 1.024 },  // 125 KHz
    { 16.384,  8.192, 4.096, 2.048, 1.024, 0.512 },  // 250 KHz
    { 8.192,  4.096, 2.048, 1.024, 0.512, 0.256 }   // 500 KHz
};


#ifdef MBED_CONF_STM32WL_LORA_DRIVER_DEBUG_RX
static DigitalOut _rf_dbg_rx(MBED_CONF_STM32WL_LORA_DRIVER_DEBUG_RX, 0);
#endif

#ifdef MBED_CONF_STM32WL_LORA_DRIVER_DEBUG_TX
static DigitalOut _rf_dbg_tx(MBED_CONF_STM32WL_LORA_DRIVER_DEBUG_TX, 0);
#endif


STM32WL_LoRaRadio::STM32WL_LoRaRadio()
{
    set_antenna_switch(RBI_SWITCH_OFF);

    _radio_events = NULL;
    _image_calibrated = false;
    _force_image_calibration = false;
    _active_modem = MODEM_LORA;

}

STM32WL_LoRaRadio::~STM32WL_LoRaRadio()
{

}

/**
  * Acquire radio lock
  */
void STM32WL_LoRaRadio::lock(void)
{
    mutex.lock();
}

/**
  * Release radio lock
  */
void STM32WL_LoRaRadio::unlock(void)
{
    mutex.unlock();
}


/**
  * @brief This function handles SUBGHZ Radio Interrupt.
  */
static void SUBGHZ_Radio_IRQHandler(void)
{
    RadioIrqProcess();
}

uint32_t STM32WL_LoRaRadio::RadioGetWakeupTime(void)
{
    return (MBED_CONF_STM32WL_LORA_DRIVER_RF_WAKEUP_TIME   + MBED_CONF_LORA_WAKEUP_TIME);
}

uint16_t STM32WL_LoRaRadio::get_irq_status(void)
{
    uint8_t status[2];

    read_opmode_command((uint8_t) RADIO_GET_IRQSTATUS, status, 2);
    return (status[0] << 8) | status[1];
}

void STM32WL_LoRaRadio::clear_irq_status(uint16_t irq)
{
    uint8_t buf[2];

    buf[0] = (uint8_t)(((uint16_t) irq >> 8) & 0x00FF);
    buf[1] = (uint8_t)((uint16_t) irq & 0x00FF);
    write_opmode_command((uint8_t) RADIO_CLR_IRQSTATUS, buf, 2);
}

//       Better do CAD here. CAD code is already part of the driver
//       It needs to be hooked up to the stack (this API will need change
//       and the stack will need changes too)
bool STM32WL_LoRaRadio::perform_carrier_sense(radio_modems_t modem,
                                              uint32_t freq,
                                              int16_t rssi_threshold,
                                              uint32_t max_carrier_sense_time)
{
    bool status = true;
    int16_t rssi = 0;
    uint32_t sleep_duration;

    set_modem(modem);
    set_channel(freq);
    _reception_mode = RECEPTION_MODE_OTHER;
    _rx_timeout = 0x00000000;
    receive();

    sleep_duration = RadioGetWakeupTime();
    // hold on a bit, radio turn-around time
    rtos::ThisThread::sleep_for(sleep_duration);

    Timer elapsed_time;
    elapsed_time.start();

    // Perform carrier sense for maxCarrierSenseTime
    while (elapsed_time.read_ms() < (int) max_carrier_sense_time) {
        rssi = get_rssi();

        if (rssi > rssi_threshold) {
            status = false;
            break;
        }
    }

    /* radio sleep */
    sleep();
    return status;
}

void STM32WL_LoRaRadio::start_cad(void)
{
    //       CAD is more advanced in SX126X. We will need API change in LoRaRadio
    //       for this to act properly
}




bool STM32WL_LoRaRadio::check_rf_frequency(uint32_t frequency)
{
    return true;
}

void STM32WL_LoRaRadio::set_tx_continuous_wave(uint32_t freq, int8_t power,
                                               uint16_t time)
{
    // This is useless. We even removed the support from our MAC layer.
}




/* STM32WL driver specific functions */
void HAL_SUBGHZ_MspInit(SUBGHZ_HandleTypeDef *subghzHandle)
{

    core_util_critical_section_enter();

    /* SUBGHZ clock enable */
    __HAL_RCC_SUBGHZSPI_CLK_ENABLE();

