ARMmbed/mbed-os/connectivity/drivers/lora/TARGET_STM32WL/STM32WL_LoRaRadio.cpp
    /* SUBGHZ interrupt Init */
    NVIC_SetVector(SUBGHZ_Radio_IRQn, (uint32_t)SUBGHZ_Radio_IRQHandler);
    NVIC_EnableIRQ(SUBGHZ_Radio_IRQn);


    core_util_critical_section_exit();

}

static void RadioIrqProcess()
{
    radio_irq_masks_t irq_status;


    irq_status = (radio_irq_masks_t)STM32WL_LoRaRadio::get_irq_status();
    /* clear IRQs lines after recovering their status */
    STM32WL_LoRaRadio::clear_irq_status(IRQ_RADIO_ALL);


    if ((irq_status & IRQ_TX_DONE) == IRQ_TX_DONE) {
        STM32WL_LoRaRadio::HAL_SUBGHZ_TxCpltCallback();
    }

    if ((irq_status & IRQ_RX_DONE) == IRQ_RX_DONE) {
        STM32WL_LoRaRadio::HAL_SUBGHZ_RxCpltCallback();
    }

    if ((irq_status & IRQ_CAD_DONE) == IRQ_CAD_DONE) {
        STM32WL_LoRaRadio::HAL_SUBGHZ_CADStatusCallback();
    }

    if ((irq_status & IRQ_RX_TX_TIMEOUT) == IRQ_RX_TX_TIMEOUT) {
        STM32WL_LoRaRadio::HAL_SUBGHZ_RxTxTimeoutCallback();
    }
}
/* ----- */
/* HAL_SUBGHz Callbacks definitions */
void STM32WL_LoRaRadio::HAL_SUBGHZ_TxCpltCallback(void)
{
    if (_radio_events->tx_done) {
        _radio_events->tx_done();

#ifdef MBED_CONF_STM32WL_LORA_DRIVER_DEBUG_TX
        /* Reset TX DBG pin */
        _rf_dbg_tx = DEBUG_LED_OFF;
#endif
    }
}

void STM32WL_LoRaRadio::HAL_SUBGHZ_RxCpltCallback(void)
{
    if (_radio_events->rx_done) {
        uint8_t offset = 0;
        uint8_t payload_len = 0;
        int16_t rssi = 0;
        int8_t snr = 0;
        packet_status_t pkt_status;

        get_rx_buffer_status(&payload_len, &offset);
        read_fifo(_data_buffer, payload_len, offset);
        get_packet_status(&pkt_status);
        if (pkt_status.modem_type == MODEM_FSK) {
            rssi = pkt_status.params.gfsk.rssi_sync;
        } else {
            rssi = pkt_status.params.lora.rssi_pkt;
            snr = pkt_status.params.lora.snr_pkt;
        }

        _radio_events->rx_done(_data_buffer, payload_len, rssi, snr);

#ifdef MBED_CONF_STM32WL_LORA_DRIVER_DEBUG_RX
        /* Reset RX DBG pin */
        _rf_dbg_rx = DEBUG_LED_OFF;
#endif
    }
}

void STM32WL_LoRaRadio::HAL_SUBGHZ_CRCErrorCallback(void)
{
    if (_radio_events && _radio_events->rx_error) {
        _radio_events->rx_error();
    }
}

void STM32WL_LoRaRadio::HAL_SUBGHZ_CADStatusCallback(void)
{
    uint16_t irq_status = STM32WL_LoRaRadio::get_irq_status();

    if (_radio_events->cad_done) {
        _radio_events->cad_done((irq_status & IRQ_CAD_ACTIVITY_DETECTED)
                                == IRQ_CAD_ACTIVITY_DETECTED);
    }
}


void STM32WL_LoRaRadio::HAL_SUBGHZ_RxTxTimeoutCallback(void)
{
    if ((_radio_events->tx_timeout) && (_operating_mode == MODE_TX)) {
        _radio_events->tx_timeout();

#if MBED_CONF_STM32WL_LORA_DRIVER_DEBUG_TX
        /* Reset TX DBG pin */
        _rf_dbg_tx = DEBUG_LED_OFF;
#endif

    } else if ((_radio_events && _radio_events->rx_timeout) && (_operating_mode == MODE_RX)) {
        _radio_events->rx_timeout();

#ifdef MBED_CONF_STM32WL_LORA_DRIVER_DEBUG_RX
        /* Reset RX DBG pin */
        _rf_dbg_rx = DEBUG_LED_OFF;
#endif
    }
}

/* ----- */
/* HAL_SUBGHz Callbacks definitions END */


/* STM32WL specific BSP Nucleo board functions */
void STM32WL_LoRaRadio::SUBGRF_SetSwitch(uint8_t paSelect, RFState_t rxtx)
{
    RBI_Switch_TypeDef state = RBI_SWITCH_RX;

    if (rxtx == RFSWITCH_TX) {
        if (paSelect == RFO_LP) {
            state = RBI_SWITCH_RFO_LP;
            Radio_SMPS_Set(SMPS_DRIVE_SETTING_MAX);
        }
        if (paSelect == RFO_HP) {
            state = RBI_SWITCH_RFO_HP;
        }
    } else {
        if (rxtx == RFSWITCH_RX) {
            state = RBI_SWITCH_RX;
        }
    }
    set_antenna_switch(state);
}

uint8_t STM32WL_LoRaRadio::SUBGRF_SetRfTxPower(int8_t power)
{
    uint8_t paSelect = RFO_LP;

    int32_t TxConfig = board_rf_switch_config;

    switch (TxConfig) {
        case RBI_CONF_RFO_LP_HP: {
            if (power > 15) {
                paSelect = RFO_HP;
            } else {
                paSelect = RFO_LP;
            }
            break;
        }
        case RBI_CONF_RFO_LP: {
            paSelect = RFO_LP;
            break;
        }
        case RBI_CONF_RFO_HP: {
            paSelect = RFO_HP;
            break;
        }
        default:
            break;
    }

    SUBGRF_SetTxParams(paSelect, power, RADIO_RAMP_40_US);

    return paSelect;
}


void STM32WL_LoRaRadio::SUBGRF_SetTxParams(uint8_t paSelect, int8_t power, radio_ramp_time_t rampTime)
{
    uint8_t buf[2];

    if (paSelect == RFO_LP) {
        if (power == 15) {
            set_pa_config(0x06, 0x00, 0x01, 0x01);
        } else {
            set_pa_config(0x04, 0x00, 0x01, 0x01);
        }
        if (power >= 14) {
            power = 14;
        } else if (power < -17) {
            power = -17;
        }
        write_to_register(REG_OCP, 0x18);   // current max is 80 mA for the whole device
    } else { // rfo_hp
        // Better Resistance of the radio Tx to Antenna Mismatch
        // RegTxClampConfig = @address 0x08D8
        write_to_register(REG_TX_CLAMP, read_register(REG_TX_CLAMP) | (0x0F << 1));

        set_pa_config(0x04, 0x07, 0x00, 0x01);
        if (power > 22) {
            power = 22;
        } else if (power < -9) {
            power = -9;
        }
        write_to_register(REG_OCP, 0x38);   // current max 160mA for the whole device
    }
    buf[0] = power;
    buf[1] = (uint8_t)rampTime;
    write_opmode_command(RADIO_SET_TXPARAMS, buf, 2);
}

void STM32WL_LoRaRadio::Radio_SMPS_Set(uint8_t level)
{
    if (1U == regulator_mode) {
        uint8_t modReg;
        modReg = read_register(SUBGHZ_SMPSC2R);
        modReg &= (~SMPS_DRV_MASK);
        write_to_register(SUBGHZ_SMPSC2R, modReg | level);
    }
}

void STM32WL_LoRaRadio::calibrate_image(uint32_t freq)
{
    uint8_t cal_freq[2];

    if (freq > 900000000) {
        cal_freq[0] = 0xE1;
        cal_freq[1] = 0xE9;
    } else if (freq > 850000000) {
        cal_freq[0] = 0xD7;
        cal_freq[1] = 0xD8;
    } else if (freq > 770000000) {
        cal_freq[0] = 0xC1;
        cal_freq[1] = 0xC5;
    } else if (freq > 460000000) {
        cal_freq[0] = 0x75;
        cal_freq[1] = 0x81;
    } else if (freq > 425000000) {
        cal_freq[0] = 0x6B;
        cal_freq[1] = 0x6F;
    }

    write_opmode_command((uint8_t) RADIO_CALIBRATEIMAGE, cal_freq, 2);

    _image_calibrated = true;
}

void STM32WL_LoRaRadio::set_channel(uint32_t frequency)
{
#if MBED_CONF_STM32WL_LORA_DRIVER_SLEEP_MODE == 1
    // At this point, we are not sure what is the Modem type, set both
    _mod_params.params.lora.operational_frequency = frequency;
    _mod_params.params.gfsk.operational_frequency = frequency;
#endif

    uint8_t buf[4];
    uint32_t freq = 0;

    if (_force_image_calibration || !_image_calibrated) {
        calibrate_image(frequency);
        _image_calibrated = true;
    }

    freq = (uint32_t) ceil((float) frequency / (float) FREQ_STEP);
    buf[0] = (uint8_t)((freq >> 24) & 0xFF);
    buf[1] = (uint8_t)((freq >> 16) & 0xFF);
    buf[2] = (uint8_t)((freq >> 8) & 0xFF);
    buf[3] = (uint8_t)(freq & 0xFF);

