ARMmbed/mbed-os/connectivity/drivers/lora/TARGET_STM32WL/STM32WL_LoRaRadio.cpp
    write_opmode_command((uint8_t) RADIO_SET_RFFREQUENCY, buf, 4);
}

/**
  * Put radio in Standby mode
  */
void STM32WL_LoRaRadio::standby(void)
{
    if (_operating_mode == MODE_STDBY_RC) {
        return;
    }

#if MBED_CONF_STM32WL_LORA_DRIVER_STANDBY_MODE == 1
    uint8_t standby_mode = 1;
#else
    uint8_t standby_mode = 0;
#endif
    write_opmode_command((uint8_t) RADIO_SET_STANDBY, &standby_mode, 1);

    if (standby_mode == STDBY_RC) {
        _operating_mode = MODE_STDBY_RC;
    } else {
        _operating_mode = MODE_STDBY_XOSC;
    }
}


void STM32WL_LoRaRadio::SUBGRF_SetTcxoMode(radio_TCXO_ctrl_voltage_t voltage,
                                           uint32_t timeout)
{
    uint8_t buf[4];

    buf[0] = voltage & 0x07;
    buf[1] = (uint8_t)((timeout >> 16) & 0xFF);
    buf[2] = (uint8_t)((timeout >> 8) & 0xFF);
    buf[3] = (uint8_t)(timeout & 0xFF);

    write_opmode_command(RADIO_SET_TCXOMODE, buf, 4);
}

void STM32WL_LoRaRadio::init_radio(radio_events_t *events)
{
    HAL_StatusTypeDef error_value;
    uint32_t vector = 0;

    _radio_events = events;

    _tx_timeout = 0;
    _rx_timeout = 0;

    //call to HAL_SUBGHZ_Init() for MSPInit and NVIC Radio_IRQ setting
    error_value = HAL_SUBGHZ_Init(&hsubghz);

    MBED_ASSERT(error_value == HAL_OK);

    // this is a POR sequence
    cold_start_wakeup();

    SUBGRF_SetTxParams(RFO_LP, 0, RADIO_RAMP_200_US);

    sleep();

}


void STM32WL_LoRaRadio::cold_start_wakeup()
{
    GPIO_InitTypeDef  gpio_init_structure = {0};

    write_opmode_command(RADIO_SET_REGULATORMODE, &regulator_mode, 1);
    set_buffer_base_addr(0x00, 0x00);

    if (crystal_select == 1) {
        calibration_params_t calib_param;

        SUBGRF_SetTcxoMode(TCXO_CTRL_VOLTAGE, MBED_CONF_STM32WL_LORA_DRIVER_RF_WAKEUP_TIME << 6); //100 ms

        calib_param.value = 0x7F;
        write_opmode_command(RADIO_CALIBRATE, &calib_param.value, 1);
    }


    _operating_mode = MODE_STDBY_RC;

    set_modem(_active_modem);

    if (_active_modem == MODEM_LORA) {
        set_public_network(_network_mode_public);
    }
}

void STM32WL_LoRaRadio::set_public_network(bool enable)
{
    if (enable) {
        // Change LoRa modem SyncWord
        write_to_register(REG_LR_SYNCWORD, (LORA_MAC_PUBLIC_SYNCWORD >> 8) & 0xFF);
        write_to_register(REG_LR_SYNCWORD + 1, LORA_MAC_PUBLIC_SYNCWORD & 0xFF);
    } else {
        // Change LoRa modem SyncWord
        write_to_register(REG_LR_SYNCWORD, (LORA_MAC_PRIVATE_SYNCWORD >> 8) & 0xFF);
        write_to_register(REG_LR_SYNCWORD + 1, LORA_MAC_PRIVATE_SYNCWORD & 0xFF);
    }
}

uint32_t STM32WL_LoRaRadio::time_on_air(radio_modems_t modem, uint8_t pkt_len)
{
    uint32_t air_time = 0;

    switch (modem) {
        case MODEM_FSK: {
            air_time = rint((8 * (_packet_params.params.gfsk.preamble_length
                                  + (_packet_params.params.gfsk.syncword_length >> 3)
                                  + ((_packet_params.params.gfsk.header_type
                                      == RADIO_PACKET_FIXED_LENGTH) ? 0.0f : 1.0f) + pkt_len
                                  + ((_packet_params.params.gfsk.crc_length == RADIO_CRC_2_BYTES) ? 2.0f : 0.0f))
                             / _mod_params.params.gfsk.bit_rate) * 1000);
        }
        break;
        case MODEM_LORA: {
            float ts = lora_symbol_time[_mod_params.params.lora.bandwidth - 4][12
                                                                               - _mod_params.params.lora.spreading_factor];
            // time of preamble
            float t_preamble = (_packet_params.params.lora.preamble_length + 4.25f) * ts;
            // Symbol length of payload and time
            float tmp = ceil((8 * pkt_len - 4 * _mod_params.params.lora.spreading_factor
                              + 28 + 16 * _packet_params.params.lora.crc_mode
                              - ((_packet_params.params.lora.header_type == LORA_PACKET_FIXED_LENGTH) ? 20 : 0))
                             / (float)(4 * (_mod_params.params.lora.spreading_factor
                                            - ((_mod_params.params.lora.low_datarate_optimization > 0) ? 2 : 0))))
                        * ((_mod_params.params.lora.coding_rate % 4) + 4);
            float n_payload = 8 + ((tmp > 0) ? tmp : 0);
            float t_payload = n_payload * ts;
            // Time on air
            float tOnAir = t_preamble + t_payload;
            // return milliseconds (as ts is in milliseconds)
            air_time = floor(tOnAir + 0.999);
        }
        break;
    }

    return air_time;
}

void STM32WL_LoRaRadio::radio_reset()
{

    // give some time for automatic image calibration
    rtos::ThisThread::sleep_for(6ms);
}

void STM32WL_LoRaRadio::wakeup()
{
    // hold the NSS low, this should wakeup the chip.
    // now we should wait for the _busy line to go low
    if (_operating_mode == MODE_SLEEP) {
#if MBED_CONF_STM32WL_LORA_DRIVER_SLEEP_MODE == 1
        wait_us(3500);
        // whenever we wakeup from Cold sleep state, we need to perform
        // image calibration
        _force_image_calibration = true;
        cold_start_wakeup();
#endif
    }
}

void STM32WL_LoRaRadio::sleep(void)
{
#if MBED_CONF_STM32WL_LORA_DRIVER_SLEEP_MODE == 1
    // cold start, power consumption 160 nA
    sleep_state = 0x00;
#endif

    /* switch the antenna OFF by SW */
    set_antenna_switch(RBI_SWITCH_OFF);
    Radio_SMPS_Set(SMPS_DRIVE_SETTING_DEFAULT);


    // warm start set , power consumption 600 nA
    uint8_t sleep_state = 0x04;
    write_opmode_command(RADIO_SET_SLEEP, &sleep_state, 1);

    _operating_mode = MODE_SLEEP;
    rtos::ThisThread::sleep_for(2ms);
}

uint32_t STM32WL_LoRaRadio::random(void)
{
    set_modem(MODEM_LORA);
    uint8_t buf[] = {0, 0, 0, 0};

    // Set radio in continuous reception
    _reception_mode = RECEPTION_MODE_OTHER;
    _rx_timeout = 0xFFFFFFFF;
    receive();

    read_register(RANDOM_NUMBER_GENERATORBASEADDR, buf, 4);
    standby();

