ARMmbed/mbed-os/connectivity/drivers/lora/TARGET_STM32WL/STM32WL_LoRaRadio.cpp
    return (buf[0] << 24) | (buf[1] << 16) | (buf[2] << 8) | buf[3];
}

void STM32WL_LoRaRadio::write_opmode_command(uint8_t cmd, uint8_t *buffer, uint16_t size)
{
    HAL_StatusTypeDef error_value;

    error_value = HAL_SUBGHZ_ExecSetCmd(&hsubghz, (SUBGHZ_RadioSetCmd_t)cmd, buffer, size);
    MBED_ASSERT(error_value == HAL_OK);

}

void STM32WL_LoRaRadio::read_opmode_command(uint8_t cmd, uint8_t *buffer, uint16_t size)
{
    HAL_StatusTypeDef error_value;

    error_value = HAL_SUBGHZ_ExecGetCmd(&hsubghz, (SUBGHZ_RadioGetCmd_t)cmd, buffer, size);
    MBED_ASSERT(error_value == HAL_OK);

}

void STM32WL_LoRaRadio::write_to_register(uint16_t addr, uint8_t data)
{
    HAL_StatusTypeDef error_value;

    error_value = HAL_SUBGHZ_WriteRegisters(&hsubghz, addr, (uint8_t *)&data, 1);
    MBED_ASSERT(error_value == HAL_OK);

}

void STM32WL_LoRaRadio::write_to_register(uint16_t addr, uint8_t *data,
                                          uint8_t size)
{
    HAL_StatusTypeDef error_value;

    error_value = HAL_SUBGHZ_WriteRegisters(&hsubghz, addr, data, size);
    MBED_ASSERT(error_value == HAL_OK);

}

uint8_t STM32WL_LoRaRadio::read_register(uint16_t addr)
{
    uint8_t data;
    HAL_StatusTypeDef error_value;

    error_value = HAL_SUBGHZ_ReadRegisters(&hsubghz, addr, &data, 1);
    MBED_ASSERT(error_value == HAL_OK);

    return data;

}

void STM32WL_LoRaRadio::read_register(uint16_t addr, uint8_t *buffer,
                                      uint8_t size)
{
    HAL_StatusTypeDef error_value;

    error_value = HAL_SUBGHZ_ReadRegisters(&hsubghz, addr, buffer, size);
    MBED_ASSERT(error_value == HAL_OK);

}

void STM32WL_LoRaRadio::write_fifo(uint8_t *buffer, uint8_t size)
{
    HAL_StatusTypeDef error_value;

    error_value = HAL_SUBGHZ_WriteBuffer(&hsubghz, 0, buffer, size);
    MBED_ASSERT(error_value == HAL_OK);

}

void STM32WL_LoRaRadio::set_modem(uint8_t modem)
{
    _active_modem = modem;

    // setting modem type must happen in standby mode
    if (_operating_mode != MODE_STDBY_RC) {
        // radio standby
        standby();
    }

    write_opmode_command(RADIO_SET_PACKETTYPE, &_active_modem, 1);
}

uint8_t STM32WL_LoRaRadio::get_modem()
{
    return _active_modem;
}

void STM32WL_LoRaRadio::read_fifo(uint8_t *buffer, uint8_t size, uint8_t offset)
{
    HAL_StatusTypeDef error_value;

    error_value = HAL_SUBGHZ_ReadBuffer(&hsubghz, offset, buffer, size);
    MBED_ASSERT(error_value == HAL_OK);
}


uint8_t STM32WL_LoRaRadio::get_fsk_bw_reg_val(uint32_t bandwidth)
{
    uint8_t i;

    for (i = 0; i < (sizeof(fsk_bandwidths) / sizeof(fsk_bw_t)) - 1; i++) {
        if ((bandwidth >= fsk_bandwidths[i].bandwidth)
                && (bandwidth < fsk_bandwidths[i + 1].bandwidth)) {
            return fsk_bandwidths[i].register_value;
        }
    }
    // ERROR: Value not found
    // This should never happen
    while (1);
}

void STM32WL_LoRaRadio::set_max_payload_length(radio_modems_t modem, uint8_t max)
{
    if (modem == MODEM_LORA) {
        _packet_params.params.lora.payload_length = max;
    } else {
        _packet_params.params.gfsk.payload_length = max;
    }
}

void STM32WL_LoRaRadio::set_tx_config(radio_modems_t modem,
                                      int8_t power,
                                      uint32_t fdev,
                                      uint32_t bandwidth,
                                      uint32_t datarate,
                                      uint8_t coderate,
                                      uint16_t preamble_len,
                                      bool fix_len,
                                      bool crc_on,
                                      bool freq_hop_on,
                                      uint8_t hop_period,
                                      bool iq_inverted,
                                      uint32_t timeout)
{

    uint8_t modem_type = (uint8_t) modem;
    switch (modem_type) {
        case MODEM_FSK:
            _mod_params.modem_type = MODEM_FSK;
            _mod_params.params.gfsk.bit_rate = datarate;

            _mod_params.params.gfsk.modulation_shaping = MOD_SHAPING_G_BT_1;
            _mod_params.params.gfsk.bandwidth = get_fsk_bw_reg_val(bandwidth);
            _mod_params.params.gfsk.fdev = fdev;

            _packet_params.modem_type = MODEM_FSK;
            _packet_params.params.gfsk.preamble_length = (preamble_len << 3); // convert byte into bit
            _packet_params.params.gfsk.preamble_min_detect = RADIO_PREAMBLE_DETECTOR_08_BITS;
            _packet_params.params.gfsk.syncword_length = 3 << 3; // convert byte into bit
            _packet_params.params.gfsk.addr_comp = RADIO_ADDRESSCOMP_FILT_OFF;
            _packet_params.params.gfsk.header_type = (fix_len == true) ?
                                                     RADIO_PACKET_FIXED_LENGTH :
                                                     RADIO_PACKET_VARIABLE_LENGTH;

            if (crc_on) {
                _packet_params.params.gfsk.crc_length = RADIO_CRC_2_BYTES_CCIT;
            } else {
                _packet_params.params.gfsk.crc_length = RADIO_CRC_OFF;
            }
            _packet_params.params.gfsk.whitening_mode = RADIO_DC_FREEWHITENING;

            set_modem(MODEM_FSK);

            write_to_register(REG_LR_SYNCWORDBASEADDRESS, (uint8_t *) sync_word, 8);
            set_whitening_seed(0x01FF);
            break;

        case MODEM_LORA:
            _mod_params.modem_type = MODEM_LORA;
            _mod_params.params.lora.spreading_factor = (lora_spread_factors_t) datarate;
            _mod_params.params.lora.bandwidth = (lora_bandwidths_t) lora_bandwidths[bandwidth];
            _mod_params.params.lora.coding_rate = (lora_coding_states_t) coderate;

            if (((bandwidth == 0) && ((datarate == 11) || (datarate == 12)))
                    || ((bandwidth == 1) && (datarate == 12))) {
                _mod_params.params.lora.low_datarate_optimization = 0x01;
            } else {
                _mod_params.params.lora.low_datarate_optimization = 0x00;
            }

            _packet_params.modem_type = MODEM_LORA;

